; ModuleID = 'ebr.c'
source_filename = "ebr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ck_epoch = type { i32, i32, %struct.ck_stack }
%struct.ck_stack = type { ptr, ptr }
%struct.ck_epoch_record = type { %struct.ck_stack_entry, ptr, i32, i32, i32, [36 x i8], %struct.anon, i32, i32, i32, ptr, [4 x %struct.ck_stack], [24 x i8] }
%struct.ck_stack_entry = type { ptr }
%struct.anon = type { [2 x %struct.ck_epoch_ref] }
%struct.ck_epoch_ref = type { i32, i32 }
%struct.ck_epoch_section = type { i32 }
%struct.ck_epoch_entry = type { ptr, %struct.ck_stack_entry }

@stack_epoch = internal global %struct.ck_epoch zeroinitializer, align 8, !dbg !0
@records = dso_local global [4 x %struct.ck_epoch_record] zeroinitializer, align 64, !dbg !87
@.str = private unnamed_addr constant [41 x i8] c"!(local_epoch == 1 && global_epoch == 3)\00", align 1, !dbg !90
@.str.1 = private unnamed_addr constant [6 x i8] c"ebr.c\00", align 1, !dbg !95
@__PRETTY_FUNCTION__.thread = private unnamed_addr constant [21 x i8] c"void *thread(void *)\00", align 1, !dbg !100

; Function Attrs: noinline nounwind optnone uwtable
define dso_local zeroext i1 @_ck_epoch_delref(ptr noundef %0, ptr noundef %1) #0 !dbg !115 {
  %3 = alloca i1, align 1
  %4 = alloca ptr, align 8
  %5 = alloca ptr, align 8
  %6 = alloca ptr, align 8
  %7 = alloca ptr, align 8
  %8 = alloca i32, align 4
  store ptr %0, ptr %4, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stack_epoch", scope: !2, file: !3, line: 23, type: !106, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !86, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "ebr.c", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "97073fc1e306f2d013b171ccf01e7e22")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 138, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/ck_epoch.c", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "6acf017f2c970ef5b9eb888b55a36640")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "CK_EPOCH_STATE_USED", value: 0)
!10 = !DIEnumerator(name: "CK_EPOCH_STATE_FREE", value: 1)
!11 = !{!12, !13, !14, !15, !17, !40, !64, !27, !70, !72, !73, !84}
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_record", file: !19, line: 85, size: 1536, align: 512, elements: !20)
!19 = !DIFile(filename: "include/ck_epoch.h", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "2210cffd498b468d38353410cd7d3066")
!20 = !{!21, !28, !42, !43, !44, !45, !56, !57, !58, !59, !60}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "record_next", scope: !18, file: !19, line: 86, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_entry_t", file: !23, line: 38, baseType: !24)
!23 = !DIFile(filename: "include/ck_stack.h", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "19674f5fb31e41969a7583ca1d1160b2")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack_entry", file: !23, line: 35, size: 64, elements: !25)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !23, line: 36, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !18, file: !19, line: 87, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch", file: !19, line: 102, size: 192, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !30, file: !19, line: 103, baseType: !7, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "n_free", scope: !30, file: !19, line: 104, baseType: !7, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !30, file: !19, line: 105, baseType: !35, size: 128, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_stack_t", file: !23, line: 44, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_stack", file: !23, line: 40, size: 128, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !36, file: !23, line: 41, baseType: !27, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !36, file: !23, line: 42, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !19, line: 88, baseType: !7, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !18, file: !19, line: 89, baseType: !7, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !18, file: !19, line: 90, baseType: !7, size: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !18, file: !19, line: 93, baseType: !46, size: 128, align: 512, offset: 512)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !18, file: !19, line: 91, size: 128, elements: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !46, file: !19, line: 92, baseType: !49, size: 128)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !54)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_ref", file: !19, line: 80, size: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !50, file: !19, line: 81, baseType: !7, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !50, file: !19, line: 82, baseType: !7, size: 32, offset: 32)
!54 = !{!55}
!55 = !DISubrange(count: 2)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "n_pending", scope: !18, file: !19, line: 94, baseType: !7, size: 32, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "n_peak", scope: !18, file: !19, line: 95, baseType: !7, size: 32, offset: 672)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "n_dispatch", scope: !18, file: !19, line: 96, baseType: !7, size: 32, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !18, file: !19, line: 97, baseType: !13, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !18, file: !19, line: 98, baseType: !61, size: 512, offset: 832)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 4)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !66, line: 27, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !68, line: 45, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!69 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_entry", file: !19, line: 60, size: 128, elements: !75)
!75 = !{!76, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !74, file: !19, line: 61, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_cb_t", file: !19, line: 54, baseType: !79)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_entry_t", file: !19, line: 53, baseType: !74)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stack_entry", scope: !74, file: !19, line: 62, baseType: !22, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_record_t", file: !19, line: 100, baseType: !18)
!86 = !{!0, !87, !90, !95, !100}
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "records", scope: !2, file: !3, line: 44, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 6144, align: 512, elements: !62)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(scope: null, file: !3, line: 37, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 328, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 41)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !3, line: 37, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 48, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 6)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !3, line: 37, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 168, elements: !104)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!104 = !{!105}
!105 = !DISubrange(count: 21)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_epoch_t", file: !19, line: 107, baseType: !30)
!107 = !{i32 7, !"Dwarf Version", i32 5}
!108 = !{i32 2, !"Debug Info Version", i32 3}
!109 = !{i32 1, !"wchar_size", i32 4}
!110 = !{i32 8, !"PIC Level", i32 2}
!111 = !{i32 7, !"PIE Level", i32 2}
!112 = !{i32 7, !"uwtable", i32 2}
!113 = !{i32 7, !"frame-pointer", i32 2}
!114 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!115 = distinct !DISubprogram(name: "_ck_epoch_delref", scope: !6, file: !6, line: 151, type: !116, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !123)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !17, !119}
!118 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_epoch_section", file: !19, line: 69, size: 32, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !120, file: !19, line: 70, baseType: !7, size: 32)
!123 = !{}
!124 = !DILocalVariable(name: "record", arg: 1, scope: !115, file: !6, line: 151, type: !17)
!125 = !DILocation(line: 151, column: 42, scope: !115)
!126 = !DILocalVariable(name: "section", arg: 2, scope: !115, file: !6, line: 152, type: !119)
!127 = !DILocation(line: 152, column: 30, scope: !115)
!128 = !DILocalVariable(name: "current", scope: !115, file: !6, line: 154, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!130 = !DILocation(line: 154, column: 23, scope: !115)
!131 = !DILocalVariable(name: "other", scope: !115, file: !6, line: 154, type: !129)
!132 = !DILocation(line: 154, column: 33, scope: !115)
!133 = !DILocalVariable(name: "i", scope: !115, file: !6, line: 155, type: !7)
!134 = !DILocation(line: 155, column: 15, scope: !115)
!135 = !DILocation(line: 155, column: 19, scope: !115)
!136 = !DILocation(line: 155, column: 28, scope: !115)
!137 = !DILocation(line: 157, column: 13, scope: !115)
!138 = !DILocation(line: 157, column: 21, scope: !115)
!139 = !DILocation(line: 157, column: 27, scope: !115)
!140 = !DILocation(line: 157, column: 34, scope: !115)
!141 = !DILocation(line: 157, column: 10, scope: !115)
!142 = !DILocation(line: 158, column: 2, scope: !115)
