; ModuleID = 'tests/spsc_queue.c'
source_filename = "tests/spsc_queue.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ck_fifo_spsc = type { %struct.ck_spinlock_fas, ptr, [52 x i8], %struct.ck_spinlock_fas, ptr, ptr, ptr }
%struct.ck_spinlock_fas = type { i32 }
%struct.point_s = type { i32, i32 }
%struct.ck_fifo_spsc_entry = type { ptr, ptr }

@queue = dso_local global %struct.ck_fifo_spsc zeroinitializer, align 8, !dbg !0
@.str = private unnamed_addr constant [20 x i8] c"NULL point received\00", align 1, !dbg !22
@.str.1 = private unnamed_addr constant [39 x i8] c"point != NULL && \22NULL point received\22\00", align 1, !dbg !28
@.str.2 = private unnamed_addr constant [19 x i8] c"tests/spsc_queue.c\00", align 1, !dbg !33
@__PRETTY_FUNCTION__.consumer = private unnamed_addr constant [23 x i8] c"void *consumer(void *)\00", align 1, !dbg !38
@.str.3 = private unnamed_addr constant [21 x i8] c"point->x == point->y\00", align 1, !dbg !44
@.str.4 = private unnamed_addr constant [14 x i8] c"point->y == 1\00", align 1, !dbg !49

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @producer(ptr noundef %0) #0 !dbg !81 {
  %2 = alloca ptr, align 8
  %3 = alloca i32, align 4
  %4 = alloca ptr, align 8
  %5 = alloca ptr, align 8
  %6 = alloca ptr, align 8
  store ptr %0, ptr %2, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "queue", scope: !2, file: !3, line: 21, type: !54, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !21, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "tests/spsc_queue.c", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "7bec67ad4368bbed4d80bc0489a6ba84")
!4 = !{!5, !6, !7, !13, !19}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !11, line: 45, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!12 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_fifo_spsc_entry", file: !15, line: 39, size: 128, elements: !16)
!15 = !DIFile(filename: "include/ck_fifo.h", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "252298fd696ccc816ddf53f92a49d2df")
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !14, file: !15, line: 40, baseType: !5, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !15, line: 41, baseType: !13, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!21 = !{!22, !28, !33, !38, !44, !49, !0}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !3, line: 63, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: 20)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !3, line: 63, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 312, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 39)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !3, line: 63, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 152, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 19)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !3, line: 63, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 184, elements: !42)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!42 = !{!43}
!43 = !DISubrange(count: 23)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !3, line: 64, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 168, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 21)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !3, line: 65, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 112, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 14)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_fifo_spsc_t", file: !15, line: 54, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_fifo_spsc", file: !15, line: 45, size: 768, elements: !56)
!56 = !{!57, !64, !65, !69, !70, !71, !72}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "m_head", scope: !55, file: !15, line: 46, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_spinlock_fas_t", file: !59, line: 42, baseType: !60)
!59 = !DIFile(filename: "include/spinlock/fas.h", directory: "/home/stefano/huawei/ck", checksumkind: CSK_MD5, checksum: "999805093e3ea65ae15690fa7c76e04b")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ck_spinlock_fas", file: !59, line: 39, size: 32, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !59, line: 40, baseType: !63, size: 32)
!63 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !55, file: !15, line: 47, baseType: !13, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !55, file: !15, line: 48, baseType: !66, size: 416, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 416, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 52)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "m_tail", scope: !55, file: !15, line: 49, baseType: !58, size: 32, offset: 544)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !55, file: !15, line: 50, baseType: !13, size: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "head_snapshot", scope: !55, file: !15, line: 51, baseType: !13, size: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "garbage", scope: !55, file: !15, line: 52, baseType: !13, size: 64, offset: 704)
!73 = !{i32 7, !"Dwarf Version", i32 5}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 1, !"wchar_size", i32 4}
!76 = !{i32 8, !"PIC Level", i32 2}
!77 = !{i32 7, !"PIE Level", i32 2}
!78 = !{i32 7, !"uwtable", i32 2}
!79 = !{i32 7, !"frame-pointer", i32 2}
!80 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!81 = distinct !DISubprogram(name: "producer", scope: !3, file: !3, line: 23, type: !82, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{!5, !5}
!84 = !{}
!85 = !DILocalVariable(name: "arg", arg: 1, scope: !81, file: !3, line: 23, type: !5)
!86 = !DILocation(line: 23, column: 22, scope: !81)
!87 = !DILocalVariable(name: "i", scope: !88, file: !3, line: 25, type: !89)
!88 = distinct !DILexicalBlock(scope: !81, file: !3, line: 25, column: 5)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DILocation(line: 25, column: 14, scope: !88)
!91 = !DILocation(line: 25, column: 10, scope: !88)
!92 = !DILocation(line: 25, column: 21, scope: !93)
!93 = distinct !DILexicalBlock(scope: !88, file: !3, line: 25, column: 5)
!94 = !DILocation(line: 25, column: 23, scope: !93)
!95 = !DILocation(line: 25, column: 5, scope: !88)
!96 = !DILocalVariable(name: "point", scope: !97, file: !3, line: 27, type: !98)
!97 = distinct !DILexicalBlock(scope: !93, file: !3, line: 26, column: 5)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "point_t", file: !3, line: 19, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "point_s", file: !3, line: 15, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !100, file: !3, line: 17, baseType: !63, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !100, file: !3, line: 18, baseType: !63, size: 32, offset: 32)
!104 = !DILocation(line: 27, column: 18, scope: !97)
!105 = !DILocation(line: 27, column: 26, scope: !97)
!106 = !DILocation(line: 28, column: 13, scope: !107)
!107 = distinct !DILexicalBlock(scope: !97, file: !3, line: 28, column: 13)
!108 = !DILocation(line: 28, column: 19, scope: !107)
!109 = !DILocation(line: 28, column: 13, scope: !97)
!110 = !DILocation(line: 30, column: 13, scope: !111)
!111 = distinct !DILexicalBlock(scope: !107, file: !3, line: 29, column: 9)
!112 = !DILocation(line: 33, column: 9, scope: !97)
!113 = !DILocation(line: 33, column: 16, scope: !97)
!114 = !DILocation(line: 33, column: 18, scope: !97)
!115 = !DILocation(line: 34, column: 9, scope: !97)
!116 = !DILocation(line: 34, column: 16, scope: !97)
!117 = !DILocation(line: 34, column: 18, scope: !97)
!118 = !DILocalVariable(name: "entry", scope: !97, file: !3, line: 36, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ck_fifo_spsc_entry_t", file: !15, line: 43, baseType: !14)
!121 = !DILocation(line: 36, column: 31, scope: !97)
!122 = !DILocation(line: 36, column: 39, scope: !97)
!123 = !DILocation(line: 37, column: 13, scope: !124)
!124 = distinct !DILexicalBlock(scope: !97, file: !3, line: 37, column: 13)
!125 = !DILocation(line: 37, column: 19, scope: !124)
!126 = !DILocation(line: 37, column: 13, scope: !97)
!127 = !DILocation(line: 39, column: 18, scope: !128)
!128 = distinct !DILexicalBlock(scope: !124, file: !3, line: 38, column: 9)
!129 = !DILocation(line: 39, column: 13, scope: !128)
!130 = !DILocation(line: 40, column: 13, scope: !128)
!131 = !DILocation(line: 43, column: 38, scope: !97)
!132 = !DILocation(line: 43, column: 45, scope: !97)
!133 = !DILocation(line: 43, column: 9, scope: !97)
!134 = !DILocation(line: 44, column: 5, scope: !97)
!135 = !DILocation(line: 25, column: 45, scope: !93)
!136 = !DILocation(line: 25, column: 5, scope: !93)
!137 = distinct !{!137, !95, !138, !139}
!138 = !DILocation(line: 44, column: 5, scope: !88)
!139 = !{!"llvm.loop.mustprogress"}
!140 = !DILocalVariable(name: "entry", scope: !81, file: !3, line: 46, type: !119)
!141 = !DILocation(line: 46, column: 27, scope: !81)
!142 = !DILocation(line: 46, column: 35, scope: !81)
!143 = !DILocation(line: 47, column: 9, scope: !144)
!144 = distinct !DILexicalBlock(scope: !81, file: !3, line: 47, column: 9)
!145 = !DILocation(line: 47, column: 15, scope: !144)
!146 = !DILocation(line: 47, column: 9, scope: !81)
!147 = !DILocation(line: 49, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !144, file: !3, line: 48, column: 5)
!149 = !DILocation(line: 51, column: 34, scope: !81)
!150 = !DILocation(line: 51, column: 5, scope: !81)
!151 = !DILocation(line: 53, column: 5, scope: !81)
!152 = distinct !DISubprogram(name: "ck_fifo_spsc_enqueue", scope: !15, file: !15, line: 124, type: !153, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !84)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !13, !5}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!156 = !DILocalVariable(name: "fifo", arg: 1, scope: !152, file: !15, line: 124, type: !155)
!157 = !DILocation(line: 124, column: 43, scope: !152)
!158 = !DILocalVariable(name: "entry", arg: 2, scope: !152, file: !15, line: 125, type: !13)
!159 = !DILocation(line: 125, column: 35, scope: !152)
!160 = !DILocalVariable(name: "value", arg: 3, scope: !152, file: !15, line: 126, type: !5)
!161 = !DILocation(line: 126, column: 14, scope: !152)
!162 = !DILocation(line: 129, column: 17, scope: !152)
!163 = !DILocation(line: 129, column: 2, scope: !152)
!164 = !DILocation(line: 129, column: 9, scope: !152)
!165 = !DILocation(line: 129, column: 15, scope: !152)
!166 = !DILocation(line: 130, column: 2, scope: !152)
